org/blog/2021/random-blog.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 随机展示写过的博客

一个美妙的想法，都是经过一段时间沉淀，然后在某天突然想把它完成，经过一段时间的思考，最终实现。

写过很多内容，但是如果不刻意地去阅读，就会遗忘。我的想法就是：通过一个页面，随机展示写过的内容。

这个想法第一次出现，是几个月以前，那时候没有足够的能力去实现，对自己也没有信心。昨天上午，这个想法突然造访，我有了立刻实现它的念头。

我找到以前很喜欢的一个随机格言页面，这个页面用到了 Vue，因为想着能尝试一下 Vue，所以一开始想直接把博客题目导出，放到其中一个函数里，作为返回数据。不过因为根本不了解 Vue 的用法而放弃。

整个代码中，最重要的就是 =Math.ceil(Math.random() * data.length)= ，它能生成不大于 data 对象长度的整数。接下来便是，把每一个 JSON 对象，通过 DOM 传入对应的 HTML 元素。

页面在这里：[[https://tianheg.github.io/random-blog/][随机文章]]；

GitHub 仓库在这里：[[https://github.com/tianheg/random-blog][tianheg/random-blog]]。