blog/2021/random-blog.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 16:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>随机展示写过的博客</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">随机展示写过的博客</h1>
</header><p>
一个美妙的想法，都是经过一段时间沉淀，然后在某天突然想把它完成，经过一段时间的思考，最终实现。
</p>

<p>
写过很多内容，但是如果不刻意地去阅读，就会遗忘。我的想法就是：通过一个页面，随机展示写过的内容。
</p>

<p>
这个想法第一次出现，是几个月以前，那时候没有足够的能力去实现，对自己也没有信心。昨天上午，这个想法突然造访，我有了立刻实现它的念头。
</p>

<p>
我找到以前很喜欢的一个随机格言页面，这个页面用到了 Vue，因为想着能尝试一下 Vue，所以一开始想直接把博客题目导出，放到其中一个函数里，作为返回数据。不过因为根本不了解 Vue 的用法而放弃。
</p>

<p>
整个代码中，最重要的就是 <code>Math.ceil(Math.random() * data.length)</code> ，它能生成不大于 data 对象长度的整数。接下来便是，把每一个 JSON 对象，通过 DOM 传入对应的 HTML 元素。
</p>

<p>
页面在这里：<a href="https://tianheg.github.io/random-blog/">随机文章</a>；
</p>

<p>
GitHub 仓库在这里：<a href="https://github.com/tianheg/random-blog">tianheg/random-blog</a>。</p>
</div>
</body>
</html>